## **[MySQL LIKE](https://www.mysqltutorial.org/mysql-like/)**

Use the MySQL LIKE operator to query data based on a specified pattern.

In [1]:
import pandas as pd
import numpy as np
import re
import matplotlib.pyplot as plt
import matplotlib.image as mpimg
from IPython.display import Image, SVG

from sqlalchemy_utils import database_exists, create_database
from sqlalchemy import create_engine, inspect, MetaData, text
from sqlalchemy_schemadisplay import create_schema_graph
import pymysql

pd.set_option(
    'display.max_columns', None,
    'expand_frame_repr', True,
    # 'max_rows', 10, 
    'display.max_colwidth', None,
    'display.max_rows', 10,
    # 'precision', 2,
    # 'width', 45
)

pd.set_option('display.width', 65)

In [2]:
connect_args={'ssl':{'fake_flag_to_enable_tls': True}}

engine = create_engine('mysql+pymysql://namlq:abc123@localhost/classicmodels',
                       connect_args=connect_args, echo=False
                         )
inspector = inspect(engine)

### Introduction to MySQL LIKE operator

- The syntax of the `LIKE` operator: **_expression `LIKE` pattern `ESCAPE` escape_character_**
- **_pattern_** includes `%` and `_` wildcards:

&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;`%` wildcard matches any string of zeor or more characters.

&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;`_` wildcard matches any single character

- When the **_pattern_** contains the wildcard character and you want to treat it as a regular character, you can use the `ESCAPE` clause

### MySQL LIKE operator examples

#### A) Using MySQL LIKE operator with the percentage (`%`) wildcard

- Find employees whose first names start with the letter `a`:

In [3]:
string = '''
SELECT employeeNumber, lastName, firstName
FROM employees
WHERE firstName LIKE 'a%';
'''

pd.read_sql(text(string), engine)

   employeeNumber lastName firstName
0            1143      Bow   Anthony
1            1611   Fixter      Andy

In [4]:
char = ('a', 'A')
(pd.read_sql_table('employees', engine)
 # .query("firstName.str.upper().str.startswith('A')")
 .query("firstName.str.startswith(@char)")
 [['employeeNumber', 'lastName', 'firstName']]
 .reset_index(drop=True)
)

   employeeNumber lastName firstName
0            1143      Bow   Anthony
1            1611   Fixter      Andy

- Find employees whose last names end with the literal string `on` e.g., `Patterson`, `Thomson`:

In [5]:
string = '''
SELECT employeeNumber, lastName, firstName
FROM employees
WHERE lastName LIKE '%on';
'''

df1 = pd.read_sql(text(string), engine)

In [6]:
df2 = (
    pd.read_sql_table('employees', engine)
    .query("lastName.str.endswith('on')")
    [['employeeNumber', 'lastName', 'firstName']] 
    .reset_index(drop=True)
)

In [7]:
df1.equals(df2)

True

In [8]:
df1

   employeeNumber   lastName firstName
0            1056  Patterson      Mary
1            1088  Patterson   William
2            1166   Thompson    Leslie
3            1216  Patterson     Steve

- Find all employees whose last names contain the substring `on`:

In [9]:
string = '''
SELECT employeeNumber, lastName, firstName
FROM employees
WHERE lastName LIKE '%on%'
'''

df1 = pd.read_sql(text(string), engine)

In [10]:
df2 = (
    pd.read_sql_table('employees', engine)
    .query("lastName.str.contains('on')")
    [['employeeNumber', 'lastName', 'firstName']]
    .reset_index(drop=True)
)

In [11]:
df1.equals(df2)

True

In [12]:
df1

   employeeNumber   lastName firstName
0            1056  Patterson      Mary
1            1088  Patterson   William
2            1102     Bondur    Gerard
3            1166   Thompson    Leslie
4            1216  Patterson     Steve
5            1337     Bondur      Loui
6            1504      Jones     Barry

#### B) Using MySQL LIKE operator with the underscore (`_`) wildcard

- Find employees whose first names start with `T`, end with `m`, contain any single character between

In [13]:
string = '''
SELECT employeeNumber, lastName, firstName
FROM employees
WHERE firstName LIKE 'T_m';
'''

pd.read_sql(text(string), engine)

   employeeNumber lastName firstName
0            1619     King       Tom

In [14]:
(pd.read_sql_table('employees', engine)
 .query("firstName.str.contains('T.m')")
 [['employeeNumber', 'lastName', 'firstName']]
 .reset_index(drop=True)
)

   employeeNumber lastName firstName
0            1619     King       Tom

#### C) Using MySQL NOT LIKE operator

- Search for employees whose last names don't start with the letter `B`

In [15]:
string = '''
SELECT employeeNumber, lastName, firstName
FROM employees
WHERE lastName NOT LIKE 'b%'
'''

df1 = pd.read_sql(text(string), engine)

In [16]:
char = ('b', 'B')
df2 = (
    pd.read_sql_table('employees', engine)
    .query("~lastName.str.startswith(@char)")
    [['employeeNumber', 'lastName', 'firstName']]
    .reset_index(drop=True)
)

In [17]:
df1.equals(df2)

True

In [18]:
df1.head()

   employeeNumber   lastName firstName
0            1002     Murphy     Diane
1            1056  Patterson      Mary
2            1076   Firrelli      Jeff
3            1088  Patterson   William
4            1165   Jennings    Leslie

### MySQL LIKE operator with the ESCAPE clause

- Find products whose product codes contain the string `_20`:
`'%\_20%'` is the same as `'%$_20%' ESCAPE '$'`

In [19]:
string = '''
SELECT productCode, productName
FROM products
WHERE 
    # productCode LIKE '%\_20%'
    productCode LIKE '%$_20%' ESCAPE '$'
;'''

df1 = pd.read_sql(text(string), engine)

In [20]:
df2 = (
    pd.read_sql_table('products', engine)
    .query("productCode.str.contains('_20')")
    [['productCode', 'productName']]
    .reset_index(drop=True)
)

In [21]:
df1.equals(df2)

True

In [22]:
df1

  productCode                                productName
0    S10_2016                      1996 Moto Guzzi 1100i
1    S24_2000                   1960 BSA Gold Star DBD34
2    S24_2011                      18th century schooner
3    S24_2022  1938 Cadillac V-16 Presidential Limousine
4   S700_2047                                 HMS Bounty